Repository: huixiangyang/arc-kit
Catalog: Sources/Platform/Resources/Localization/Platform.xcstrings
Source language: en
Languages: zh_hans

# file.file.exceeds
source: File exceeds %1$@
zh_hans: 文件超过 %1$@

# file.limit
source: limit: %1$@
zh_hans: 上限：%1$@

# identity.component.identity.mismatch
source: Component identity mismatch: %1$@
zh_hans: 组件身份不匹配：%1$@

# identity.expected.actual
source: Expected %1$@, actual %2$@
zh_hans: 期望 %1$@，实际 %2$@

# identity.installationMismatch
source: Running component is not from this installation
zh_hans: 运行组件不属于当前安装包

# identity.installed.component.missing.unreadable
source: Installed component missing or unreadable: %1$@ (%2$@)
zh_hans: 当前安装组件不存在或无法读取：%1$@（%2$@）

# identity.invalid.component.code.signature
source: Invalid component code signature
zh_hans: 组件代码签名无效

# identity.invalid.xpc.message.format
source: Invalid XPC message format
zh_hans: XPC 消息格式无效

# identity.mainAppVerificationFailed
source: Cannot verify the main app process
zh_hans: 无法验证主应用进程

# identity.pathMismatch
source: Running path does not match the current installation: %1$@
zh_hans: 运行路径不是当前安装路径：%1$@

# identity.senderSignatureUnreadable
source: Cannot read sender code signature (%1$@)
zh_hans: 无法读取消息发送者代码签名（%1$@）

# identity.signatureInfoUnreadable
source: Cannot read code signature information (%1$@)
zh_hans: 无法读取代码签名信息（%1$@）

# identity.signatureUnreadable
source: Cannot read running component's static signature (%1$@)
zh_hans: 无法读取运行组件静态签名（%1$@）

# identity.verificationFailed
source: Cannot verify component identity: %1$@
zh_hans: 无法验证组件身份：%1$@

# ipc.agent.connection.failed
source: Agent connection failed: %1$@
zh_hans: Agent 连接失败：%1$@

# ipc.agent.protocol.mismatch.expected.actual
source: Agent protocol mismatch: expected %1$@, actual %2$@
zh_hans: Agent 协议版本不一致：期望 %1$@，实际 %2$@

# ipc.agent.received.damaged.request
source: Agent received a damaged request
zh_hans: Agent 收到了损坏的请求

# ipc.agent.rejected.operation.outside.responsibility
source: Agent rejected an operation outside its responsibility
zh_hans: Agent 拒绝了不属于自身故障域的操作

# ipc.agent.request.expired
source: Agent request expired
zh_hans: Agent 请求已过期

# ipc.agent.request.includes.data.disallowed
source: Agent request includes data disallowed for this operation
zh_hans: Agent 请求夹带了当前操作不允许的数据

# ipc.agent.request.lacks.required.data
source: Agent request lacks required data
zh_hans: Agent 请求缺少必要数据

# ipc.agent.request.response.exceeds.size
source: Agent request or response exceeds the size limit
zh_hans: Agent 请求或响应超过大小上限

# ipc.agent.returned.damaged.response
source: Agent returned a damaged response
zh_hans: Agent 返回了损坏的响应

# ipc.request.timeout
source: Request timed out
zh_hans: 请求超时

# ipc.unknown.xpc.error
source: Unknown XPC error
zh_hans: 未知 XPC 错误

# monitor.creationFailed
source: Cannot create input monitoring. Check background status again. Monitoring failure alone does not imply permission denial.
zh_hans: 无法创建输入事件监听；请重新检测后台状态。监听失败本身不代表权限被拒绝

# request.request.queue.full.retry.later
source: Request queue full. Try again later.
zh_hans: 请求队列已满，请稍后重试

# request.runtime.session.ended.configuration.changed
source: Runtime session ended or configuration changed
zh_hans: 运行会话已结束或配置已变化

# server.agent.internal.response.violates.protocol
source: Agent internal response violates protocol: %1$@
zh_hans: Agent 内部响应不符合协议：%1$@

# server.request.already.accepted.too.many.requests
source: Request already accepted or too many requests. It will not run twice.
zh_hans: 请求已接收或请求过多，不会重复执行

# server.too.many.background.requests.retry.later
source: Too many background requests. Try again later.
zh_hans: 后台请求过多，请稍后重试

# session.identityUnavailable
source: Cannot determine main app process identity
zh_hans: 无法确定主应用进程身份

# session.main.app.runtime.session.ended
source: Main app runtime session ended
zh_hans: 主应用运行会话已经结束

# storage.data.path.local
source: The data path must be local and owned by the current user. Cloud drives, network volumes, symlinks and hard links are not allowed.
zh_hans: 数据路径必须由当前用户拥有且位于本地，不能使用云盘、网络卷、符号链接或硬链接。

# storage.path
source: Path:
zh_hans: 路径：
